src.dot
digraph "src" {

splines  = ortho;
fontname = "Inconsolata";

node [colorscheme = ylgnbu4];
edge [colorscheme = dark28, dir = both];

Acervo             [shape = record, label = "{ Acervo | - livroList : List\<Livro\>\l - filmeList : List\<Filme\>\l - serieList : List\<Serie\>\l|+ listarSeriesAvaliacao(boolean) : void\l + listarFilmes() : void\l + listarLivros() : void\l + listarLivrosAvaliacao(boolean) : void\l + listarFilmesAvaliacao(boolean) : void\l + adicionarFilme(Filme) : void\l + adicionarSerie(Serie) : void\l + getFilmeList() : List\<Filme\>\l + listarSeries() : void\l + getSerieList() : List\<Serie\>\l + adicionarLivro(Livro) : void\l + getLivroList() : List\<Livro\>\l }"];
BuscaFilme         [shape = record, label = "{ BuscaFilme | + ano(int) : void\l + buscarPorAtor(String) : void\l + buscarPorDiretor(String) : void\l + titulo(String) : void\l + buscaGenero(String) : void\l }"];
BuscaLivro         [shape = record, label = "{ BuscaLivro | + titulo(String) : void\l + isbn(String) : void\l + autor(String) : void\l + buscaGenero(String) : void\l + ano(int) : void\l }"];
BuscaSerie         [shape = record, label = "{ BuscaSerie | + buscarPorAtor(String) : void\l + ano(int) : void\l + titulo(String) : void\l + buscaGenero(String) : void\l }"];
Cadastro           [shape = record, label = "{ Cadastro | + cadastro(String, int, String, int, String, String, String, String, boolean, LocalDate) : void\l + cadastro(String, int, String, int, String, int, List\<String\>, String, String, List\<String\>, List\<String\>, LocalDate) : void\l + cadastro(String, String, int, int, String, List\<Temporada\>, int, String, String, List\<String\>) : void\l }"];
CadastroView       [shape = record, label = "{ CadastroView | ~ scanner : Scanner\l|+ cadastrarFilme() : void\l + numisbn() : String\l + verificaData(String) : LocalDate\l + cadastrarLivro() : void\l + cadastrarSerie() : void\l }"];
DiarioCultural     [shape = record, label = "{ DiarioCultural | + main(String[]) : void\l }"];
Filme              [shape = record, label = "{ Filme | - titulo : String\l - direcao : List\<String\>\l - duracao : int\l - elenco : List\<String\>\l - roteiro : List\<String\>\l - ondeAssistir : String\l - dataAssistiu : LocalDate\l|+ getDataAssistiu() : LocalDate\l + getDuracao() : int\l + setOndeAssistir(String) : void\l + getElenco() : List\<String\>\l + getTituloOriginal() : String\l + getTitulo() : String\l + getRoteiro() : List\<String\>\l + getOndeAssistir() : String\l + getDirecao() : List\<String\>\l }"];
GenerosDisponiveis [shape = record, label = "{ GenerosDisponiveis | + exibirGeneros() : String?\l }"];
Listagem           [shape = record, label = "{ Listagem | + listaFilmes(List\<Filme\>) : void\l + listaSeries(List\<Serie\>) : void\l + listaLivros(List\<Livro\>) : void\l }"];
Listar             [shape = record, label = "{ Listar | + listar() : void\l }"];
ListarFilme        [shape = record, label = "{ ListarFilme | + listar() : void\l + filtro() : void\l }"];
ListarLivro        [shape = record, label = "{ ListarLivro | + listar() : void\l + filtro() : void\l }"];
ListarSerie        [shape = record, label = "{ ListarSerie | + listar() : void\l + filtro() : void\l }"];
Livro              [shape = record, label = "{ Livro | - genero : String\l - possui : boolean\l - leitura : LocalDate\l - editora : String\l - autor : String\l - isbn : String\l|+ setGenero(String) : void\l + setEditora(String) : void\l + getLeitura() : LocalDate\l + getEditora() : String\l + setPossui(boolean) : void\l + isPossui() : boolean\l + setIsbn(String) : void\l + getAutor() : String\l + getIsbn() : String\l }"];
Menu               [shape = record, label = "{ Menu | + menu() : void\l }"];
MenuBusca          [shape = record, label = "{ MenuBusca | + menuBusca() : void\l }"];
MenuBuscaFilme     [shape = record, label = "{ MenuBuscaFilme | + menuFilme() : void\l }"];
MenuBuscaLivro     [shape = record, label = "{ MenuBuscaLivro | + menuBusca() : void\l }"];
MenuBuscaSerie     [shape = record, label = "{ MenuBuscaSerie | + menuSerie() : void\l }"];
MenuCadastro       [shape = record, label = "{ MenuCadastro | + menucadastro() : void\l }"];
Midia              [shape = record, label = "{ Midia | - nome : String\l - avaliacao : int\l - review : String\l - ano : int\l - genero : String\l|+ getAno() : int\l + getNome() : String\l + getAvaliacao() : int\l + getReview() : String\l + getGenero() : String\l }"];
Serie              [shape = record, label = "{ Serie | - tituloOriginal : String\l - ondeAssistiu : String\l - temps : List\<Temporada\>\l - elenco : List\<String\>\l - fim : int\l|+ getTemporadas() : List\<Temporada\>\l + setTemps(List\<Temporada\>) : void\l + getTituloOriginal() : String\l + getElenco() : List\<String\>\l + adicionarTemporada(Temporada) : void\l + getFim() : int\l + getOndeAssistiu() : String\l + setFim(int) : void\l + adicionarAtor(String) : void\l + getTemps() : List\<Temporada\>\l }"];
Temporada          [shape = record, label = "{ Temporada | - quantidade : int\l - avaliacao : int\l - ano : int\l - review : String\l|+ getAvaliacao() : int\l + getReview() : String\l + getQuantidade() : int\l + getAno() : int\l }"];
VerificaCadastro   [shape = record, label = "{ VerificaCadastro | + verificaCadastro(String, int, String, int, String, int, List\<String\>, String, String, List\<String\>, List\<String\>, LocalDate) : void\l - isbnValido(String) : boolean\l + verificaCadastro(String, String, int, int, String, List\<Temporada\>, int, String, String, List\<String\>) : void\l + verificaCadastro(String, int, String, int, String, String, String, String, boolean, LocalDate) : void\l }"];
VerificaInteiro    [shape = record, label = "{ VerificaInteiro | + verificaInteiro(String) : int\l }"];

Acervo             -> Filme              [color = "#595959", style = solid , arrowtail = diamond , arrowhead = vee     , taillabel = "1", label = "", headlabel = "filmeList\n*"];
Acervo             -> Listagem           [color = "#595959", style = dashed, arrowtail = none    , arrowhead = vee     , taillabel = "", label = "", headlabel = ""];
Acervo             -> Livro              [color = "#595959", style = solid , arrowtail = diamond , arrowhead = vee     , taillabel = "1", label = "", headlabel = "livroList\n*"];
Acervo             -> Serie              [color = "#595959", style = solid , arrowtail = diamond , arrowhead = vee     , taillabel = "1", label = "", headlabel = "serieList\n*"];
BuscaFilme         -> Acervo             [color = "#595959", style = dashed, arrowtail = none    , arrowhead = vee     , taillabel = "", label = "", headlabel = ""];
BuscaFilme         -> Filme              [color = "#595959", style = dashed, arrowtail = none    , arrowhead = vee     , taillabel = "", label = "", headlabel = ""];
BuscaFilme         -> Listagem           [color = "#595959", style = dashed, arrowtail = none    , arrowhead = vee     , taillabel = "", label = "", headlabel = ""];
BuscaFilme         -> Midia              [color = "#595959", style = dashed, arrowtail = none    , arrowhead = vee     , taillabel = "", label = "", headlabel = ""];
BuscaLivro         -> Acervo             [color = "#595959", style = dashed, arrowtail = none    , arrowhead = vee     , taillabel = "", label = "", headlabel = ""];
BuscaLivro         -> Listagem           [color = "#595959", style = dashed, arrowtail = none    , arrowhead = vee     , taillabel = "", label = "", headlabel = ""];
BuscaLivro         -> Livro              [color = "#595959", style = dashed, arrowtail = none    , arrowhead = vee     , taillabel = "", label = "", headlabel = ""];
BuscaLivro         -> Midia              [color = "#595959", style = dashed, arrowtail = none    , arrowhead = vee     , taillabel = "", label = "", headlabel = ""];
BuscaSerie         -> Acervo             [color = "#595959", style = dashed, arrowtail = none    , arrowhead = vee     , taillabel = "", label = "", headlabel = ""];
BuscaSerie         -> Listagem           [color = "#595959", style = dashed, arrowtail = none    , arrowhead = vee     , taillabel = "", label = "", headlabel = ""];
BuscaSerie         -> Midia              [color = "#595959", style = dashed, arrowtail = none    , arrowhead = vee     , taillabel = "", label = "", headlabel = ""];
BuscaSerie         -> Serie              [color = "#595959", style = dashed, arrowtail = none    , arrowhead = vee     , taillabel = "", label = "", headlabel = ""];
Cadastro           -> Acervo             [color = "#595959", style = dashed, arrowtail = none    , arrowhead = vee     , taillabel = "", label = "", headlabel = ""];
Cadastro           -> Filme              [color = "#595959", style = dashed, arrowtail = none    , arrowhead = vee     , taillabel = "", label = "«create»", headlabel = ""];
Cadastro           -> Livro              [color = "#595959", style = dashed, arrowtail = none    , arrowhead = vee     , taillabel = "", label = "«create»", headlabel = ""];
Cadastro           -> Serie              [color = "#595959", style = dashed, arrowtail = none    , arrowhead = vee     , taillabel = "", label = "«create»", headlabel = ""];
Cadastro           -> Temporada          [color = "#595959", style = dashed, arrowtail = none    , arrowhead = vee     , taillabel = "", label = "", headlabel = ""];
CadastroView       -> CadastroView       [color = "#595959", style = dashed, arrowtail = none    , arrowhead = vee     , taillabel = "", label = "", headlabel = ""];
CadastroView       -> GenerosDisponiveis [color = "#595959", style = dashed, arrowtail = none    , arrowhead = vee     , taillabel = "", label = "", headlabel = ""];
CadastroView       -> Temporada          [color = "#595959", style = dashed, arrowtail = none    , arrowhead = vee     , taillabel = "", label = "«create»", headlabel = ""];
CadastroView       -> VerificaCadastro   [color = "#595959", style = dashed, arrowtail = none    , arrowhead = vee     , taillabel = "", label = "", headlabel = ""];
CadastroView       -> VerificaInteiro    [color = "#595959", style = dashed, arrowtail = none    , arrowhead = vee     , taillabel = "", label = "", headlabel = ""];
DiarioCultural     -> Menu               [color = "#595959", style = dashed, arrowtail = none    , arrowhead = vee     , taillabel = "", label = "«create»", headlabel = ""];
Filme              -> Midia              [color = "#000082", style = solid , arrowtail = none    , arrowhead = normal  , taillabel = "", label = "", headlabel = ""];
GenerosDisponiveis -> VerificaInteiro    [color = "#595959", style = dashed, arrowtail = none    , arrowhead = vee     , taillabel = "", label = "", headlabel = ""];
Listagem           -> Filme              [color = "#595959", style = dashed, arrowtail = none    , arrowhead = vee     , taillabel = "", label = "", headlabel = ""];
Listagem           -> Livro              [color = "#595959", style = dashed, arrowtail = none    , arrowhead = vee     , taillabel = "", label = "", headlabel = ""];
Listagem           -> Midia              [color = "#595959", style = dashed, arrowtail = none    , arrowhead = vee     , taillabel = "", label = "", headlabel = ""];
Listagem           -> Serie              [color = "#595959", style = dashed, arrowtail = none    , arrowhead = vee     , taillabel = "", label = "", headlabel = ""];
Listagem           -> Temporada          [color = "#595959", style = dashed, arrowtail = none    , arrowhead = vee     , taillabel = "", label = "", headlabel = ""];
Listar             -> ListarFilme        [color = "#595959", style = dashed, arrowtail = none    , arrowhead = vee     , taillabel = "", label = "", headlabel = ""];
Listar             -> ListarLivro        [color = "#595959", style = dashed, arrowtail = none    , arrowhead = vee     , taillabel = "", label = "", headlabel = ""];
Listar             -> ListarSerie        [color = "#595959", style = dashed, arrowtail = none    , arrowhead = vee     , taillabel = "", label = "", headlabel = ""];
Listar             -> VerificaInteiro    [color = "#595959", style = dashed, arrowtail = none    , arrowhead = vee     , taillabel = "", label = "", headlabel = ""];
ListarFilme        -> Acervo             [color = "#595959", style = dashed, arrowtail = none    , arrowhead = vee     , taillabel = "", label = "", headlabel = ""];
ListarFilme        -> BuscaFilme         [color = "#595959", style = dashed, arrowtail = none    , arrowhead = vee     , taillabel = "", label = "", headlabel = ""];
ListarFilme        -> GenerosDisponiveis [color = "#595959", style = dashed, arrowtail = none    , arrowhead = vee     , taillabel = "", label = "", headlabel = ""];
ListarFilme        -> ListarFilme        [color = "#595959", style = dashed, arrowtail = none    , arrowhead = vee     , taillabel = "", label = "", headlabel = ""];
ListarFilme        -> VerificaInteiro    [color = "#595959", style = dashed, arrowtail = none    , arrowhead = vee     , taillabel = "", label = "", headlabel = ""];
ListarLivro        -> Acervo             [color = "#595959", style = dashed, arrowtail = none    , arrowhead = vee     , taillabel = "", label = "", headlabel = ""];
ListarLivro        -> BuscaLivro         [color = "#595959", style = dashed, arrowtail = none    , arrowhead = vee     , taillabel = "", label = "", headlabel = ""];
ListarLivro        -> GenerosDisponiveis [color = "#595959", style = dashed, arrowtail = none    , arrowhead = vee     , taillabel = "", label = "", headlabel = ""];
ListarLivro        -> ListarLivro        [color = "#595959", style = dashed, arrowtail = none    , arrowhead = vee     , taillabel = "", label = "", headlabel = ""];
ListarLivro        -> VerificaInteiro    [color = "#595959", style = dashed, arrowtail = none    , arrowhead = vee     , taillabel = "", label = "", headlabel = ""];
ListarSerie        -> Acervo             [color = "#595959", style = dashed, arrowtail = none    , arrowhead = vee     , taillabel = "", label = "", headlabel = ""];
ListarSerie        -> BuscaSerie         [color = "#595959", style = dashed, arrowtail = none    , arrowhead = vee     , taillabel = "", label = "", headlabel = ""];
ListarSerie        -> GenerosDisponiveis [color = "#595959", style = dashed, arrowtail = none    , arrowhead = vee     , taillabel = "", label = "", headlabel = ""];
ListarSerie        -> ListarSerie        [color = "#595959", style = dashed, arrowtail = none    , arrowhead = vee     , taillabel = "", label = "", headlabel = ""];
ListarSerie        -> VerificaInteiro    [color = "#595959", style = dashed, arrowtail = none    , arrowhead = vee     , taillabel = "", label = "", headlabel = ""];
Livro              -> Midia              [color = "#000082", style = solid , arrowtail = none    , arrowhead = normal  , taillabel = "", label = "", headlabel = ""];
Menu               -> Listar             [color = "#595959", style = dashed, arrowtail = none    , arrowhead = vee     , taillabel = "", label = "", headlabel = ""];
Menu               -> MenuBusca          [color = "#595959", style = dashed, arrowtail = none    , arrowhead = vee     , taillabel = "", label = "", headlabel = ""];
Menu               -> MenuCadastro       [color = "#595959", style = dashed, arrowtail = none    , arrowhead = vee     , taillabel = "", label = "", headlabel = ""];
Menu               -> VerificaInteiro    [color = "#595959", style = dashed, arrowtail = none    , arrowhead = vee     , taillabel = "", label = "", headlabel = ""];
MenuBusca          -> MenuBuscaFilme     [color = "#595959", style = dashed, arrowtail = none    , arrowhead = vee     , taillabel = "", label = "", headlabel = ""];
MenuBusca          -> MenuBuscaLivro     [color = "#595959", style = dashed, arrowtail = none    , arrowhead = vee     , taillabel = "", label = "", headlabel = ""];
MenuBusca          -> MenuBuscaSerie     [color = "#595959", style = dashed, arrowtail = none    , arrowhead = vee     , taillabel = "", label = "", headlabel = ""];
MenuBusca          -> VerificaInteiro    [color = "#595959", style = dashed, arrowtail = none    , arrowhead = vee     , taillabel = "", label = "", headlabel = ""];
MenuBuscaFilme     -> BuscaFilme         [color = "#595959", style = dashed, arrowtail = none    , arrowhead = vee     , taillabel = "", label = "", headlabel = ""];
MenuBuscaFilme     -> GenerosDisponiveis [color = "#595959", style = dashed, arrowtail = none    , arrowhead = vee     , taillabel = "", label = "", headlabel = ""];
MenuBuscaFilme     -> VerificaInteiro    [color = "#595959", style = dashed, arrowtail = none    , arrowhead = vee     , taillabel = "", label = "", headlabel = ""];
MenuBuscaLivro     -> BuscaLivro         [color = "#595959", style = dashed, arrowtail = none    , arrowhead = vee     , taillabel = "", label = "", headlabel = ""];
MenuBuscaLivro     -> GenerosDisponiveis [color = "#595959", style = dashed, arrowtail = none    , arrowhead = vee     , taillabel = "", label = "", headlabel = ""];
MenuBuscaLivro     -> VerificaInteiro    [color = "#595959", style = dashed, arrowtail = none    , arrowhead = vee     , taillabel = "", label = "", headlabel = ""];
MenuBuscaSerie     -> BuscaSerie         [color = "#595959", style = dashed, arrowtail = none    , arrowhead = vee     , taillabel = "", label = "", headlabel = ""];
MenuBuscaSerie     -> GenerosDisponiveis [color = "#595959", style = dashed, arrowtail = none    , arrowhead = vee     , taillabel = "", label = "", headlabel = ""];
MenuBuscaSerie     -> VerificaInteiro    [color = "#595959", style = dashed, arrowtail = none    , arrowhead = vee     , taillabel = "", label = "", headlabel = ""];
MenuCadastro       -> CadastroView       [color = "#595959", style = dashed, arrowtail = none    , arrowhead = vee     , taillabel = "", label = "", headlabel = ""];
MenuCadastro       -> VerificaInteiro    [color = "#595959", style = dashed, arrowtail = none    , arrowhead = vee     , taillabel = "", label = "", headlabel = ""];
Serie              -> Midia              [color = "#000082", style = solid , arrowtail = none    , arrowhead = normal  , taillabel = "", label = "", headlabel = ""];
Serie              -> Temporada          [color = "#595959", style = solid , arrowtail = diamond , arrowhead = vee     , taillabel = "1", label = "", headlabel = "temps\n*"];
VerificaCadastro   -> Cadastro           [color = "#595959", style = dashed, arrowtail = none    , arrowhead = vee     , taillabel = "", label = "", headlabel = ""];
VerificaCadastro   -> CadastroView       [color = "#595959", style = dashed, arrowtail = none    , arrowhead = vee     , taillabel = "", label = "", headlabel = ""];
VerificaCadastro   -> Temporada          [color = "#595959", style = dashed, arrowtail = none    , arrowhead = vee     , taillabel = "", label = "", headlabel = ""];
VerificaCadastro   -> VerificaCadastro   [color = "#595959", style = dashed, arrowtail = none    , arrowhead = vee     , taillabel = "", label = "", headlabel = ""];
VerificaCadastro   -> VerificaInteiro    [color = "#595959", style = dashed, arrowtail = none    , arrowhead = vee     , taillabel = "", label = "", headlabel = ""];
VerificaInteiro    -> VerificaInteiro    [color = "#595959", style = dashed, arrowtail = none    , arrowhead = vee     , taillabel = "", label = "", headlabel = ""];

}
